![image](https://pwskills.com/images/PWSkills-main.png)

# Data Science Masters

## Pandas Assignments - 1

### Date : 23 - Feb - 2023

**Q1 :** Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

**Ans :**

In [4]:
import pandas as pd

data = [4,8,15,16,23,42]

series = pd.Series(data)

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2 :** Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

**Ans :**

In [5]:
data = ['bob','ash','marley','cody','brooke','mandy','sally','judy','mark','joe']

series = pd.Series(data)

print(series)

0       bob
1       ash
2    marley
3      cody
4    brooke
5     mandy
6     sally
7      judy
8      mark
9       joe
dtype: object

**Q3 :** Create a Pandas DataFrame that contains the following data:

| **Name** | **Age** | **Gender** |
| -------- | ------- | ---------- |
| Alice    | 25      |  Female    |
| Bob      | 30      |  Male      |
| Claire    | 27      |  Female    |

Then, print the DataFrame

**Ans :**

In [9]:
data = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}

df = pd.DataFrame(data, index=None)

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4 :** What is 'DataFrame' in pandas and how is it different from pandas.series? Explain with an example.

**Ans :** **`DataFrame :`** In pandas, a DataFrame is a 2-dimensional labeled data structure that can store data of different types (e.g., numerical, categorical, textual) in rows and columns, similar to a spreadsheet or SQL table.

A DataFrame consists of rows and columns, where each column can be thought of as a Series object

*Example (DataFrame):*

In [10]:
data = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Series:** A Series is a 1-dimensional labeled array that can store homogeneous data of any type (e.g., integer, float, string, etc.). In other words, a Series is a single column of a DataFrame.

**Example (Series):**

In [11]:
data = ['Alice','Bob','Claire']

series = pd.Series(data)

series

0     Alice
1       Bob
2    Claire
dtype: object

**Q5 :** What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

**Ans :** Some of the commons functions that were discussed during today's lecture that can be used to manipulate data in Pandas are:

1. **`df.head(n) :`** In Pandas, `df.head(n)` is a method of a DataFrame object that returns the first n rows of the DataFrame.

2. **`df.tail(n) :`** In Pandas, `df.tail(n)` is a method of a DataFrame object that returns the last n rows of the DataFrame.

3. **`df.columns :`** `df.columns` returns the column names of a dataframe

4. **`df.dtypes :`** `df.dtypes` returns the data type of all the columns in a dataframe

5. **`df.shape :`** `df.shape` returns the number of rows and columns in the DataFrame.

6. **`df.info() :`** `df.info` prints a summary of the DataFrame, including the data types and non-null values of each column.

7. **`df[<column name>] :`** is not a pandas method, but it can be sued to access a single column from a datframe

8. **`df[[ ]] :`** is not a pandas method, but can be used to access multiple columns of a dataframe

In [14]:
import numpy as np

data= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan]
          }
    
df = pd.DataFrame(data)

In [15]:
df.head()

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000     None
4  PySpark  26000      NaN

In [16]:
df.head(2)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days

In [17]:
df.tail()

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000     None
4  PySpark  26000      NaN

In [18]:
df.tail(2)

   Courses    Fee Duration
3   Python  24000     None
4  PySpark  26000      NaN

In [20]:
df.columns

Index(['Courses', 'Fee', 'Duration'], dtype='object')

In [21]:
df.dtypes

Courses     object
Fee          int64
Duration    object
dtype: object

In [22]:
df.shape

(5, 3)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Courses   5 non-null      object
 1   Fee       5 non-null      int64
 2   Duration  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [25]:
df['Courses']

0      Spark
1    PySpark
2      Spark
3     Python
4    PySpark
Name: Courses, dtype: object

In [26]:
df[['Courses', 'Fee']]

   Courses    Fee
0    Spark  22000
1  PySpark  25000
2    Spark  23000
3   Python  24000
4  PySpark  26000

**Q6 :** Which of the following is mutable in nature Series, DataFrame, Panel?

**Ans :** **Pandas Series, DataFrame and Panel** all of them are mutable but panel has been deprecated and is no longer recommended for use

**Q7 :** Create a DataFrame using multiple Series. Explain with an example.

**Ans :**

In [27]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series(['a', 'b', 'c'])
s3 = pd.Series([10.5, 20.5, 30.5])

df = pd.DataFrame({'col1': s1, 'col2': s2, 'col3': s3})

df

   col1 col2  col3
0     1    a  10.5
1     2    b  20.5
2     3    c  30.5